# Browser Organization Type Enumeration

Source: https://www.revitapidocs.com/2026/ae9d1868-db91-1497-df87-1db4a35a4b9e.htm

---

| Browser Organization Type Enumeration |
| --- |

Enumerated type representing the type of browser organization.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum BrowserOrganizationType
```

```
Public Enumeration BrowserOrganizationType
```

```
public enum class BrowserOrganizationType
```

```
type BrowserOrganizationType
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| PanelSchedules | 4 | The browser organization definition for panel schedules. |
| Schedules | 3 | The browser organization definition for schedules. |
| Sheets | 1 | The browser organization definition for sheets. |
| Views | 0 | The browser organization definition for views. |

See Also

#### Reference

Autodesk.Revit.DB Namespace